mathe/abrundungsfunktion.html
---
layout: page
title: Abrundungsfunktion
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abrundungsfunktion</h2>
<div class="outline-text-2" id="text-1">
<p>
\(\lfloor \cdot \rfloor : \mathbb{R} \rightarrow \mathbb{Z}\)
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ol class="org-ol">
<li>Grenzen:
\(\forall x \in \mathbb{R}: \lfloor x \rfloor \leq x < \lfloor x \rfloor + 1\)
</li>
<li>Idempotenz:
\(\forall x \in \mathbb{R}: \lfloor \lfloor x \rfloor \rfloor = \lfloor x \rfloor\).
</li>
<li>ganze Zahlen können aus der Klammer gezogen werden:
\(\forall x \in \mathbb{R}, k \in \mathbb{Z}: \lfloor x + k \rfloor = \lfloor x \rfloor + k\)
</li>
<li>Die Summe der abgerundeten ist höchstens so groß wie die abgerundete
Summe, d.h es gilt
\(\forall x,y \in \mathbb{R}: \lfloor x \rfloor + \lfloor y \rfloor \leq \lfloor x + y \rfloor\).
</li>
<li>Die abgerundete Summe ist höchstens um \(1\) größer als die Summe der
abgerundeten, d.h es gilt
\(\forall x,y \in \mathbb{R}: \lfloor x + y \rfloor \leq \lfloor x \rfloor + \lfloor y \rfloor + 1\).
</li>
</ol>
</div>
</div>
